In [1]:
import pandas as pd
import numpy as np

s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [2]:
dates = pd.date_range('20130101',periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.620992 -1.255061  0.542316  1.050026
2013-01-02  0.108518  1.174630 -0.730138  0.259597
2013-01-03  0.146063  0.669834 -0.258898  0.502883
2013-01-04  1.502114 -0.481438 -0.445906  1.857938
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224
2013-01-06  0.871891  1.022357 -0.184152 -0.197625

In [5]:
col = list('ABCD')
col

['A', 'B', 'C', 'D']

In [6]:
df2 = pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20130102'),
                   'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                   'D':np.array([3]*4,dtype='int32'),
                   'E':pd.Categorical(["test","train","test","train"]),
                   'F':'foo'})

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
df.head()

                   A         B         C         D
2013-01-01 -1.620992 -1.255061  0.542316  1.050026
2013-01-02  0.108518  1.174630 -0.730138  0.259597
2013-01-03  0.146063  0.669834 -0.258898  0.502883
2013-01-04  1.502114 -0.481438 -0.445906  1.857938
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.502114 -0.481438 -0.445906  1.857938
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224
2013-01-06  0.871891  1.022357 -0.184152 -0.197625

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [15]:
df.values

array([[-1.6209917 , -1.25506053,  0.5423155 ,  1.050026  ],
       [ 0.10851794,  1.17462952, -0.73013803,  0.25959749],
       [ 0.14606318,  0.66983372, -0.2588978 ,  0.5028833 ],
       [ 1.50211448, -0.48143807, -0.44590587,  1.85793802],
       [-0.4018942 , -1.83866791, -1.11253022,  0.15622359],
       [ 0.8718909 ,  1.02235741, -0.18415215, -0.19762506]])

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.100950 -0.118058 -0.364885  0.604841
std    1.074955  1.263145  0.559617  0.740708
min   -1.620992 -1.838668 -1.112530 -0.197625
25%   -0.274291 -1.061655 -0.659080  0.182067
50%    0.127291  0.094198 -0.352402  0.381240
75%    0.690434  0.934226 -0.202839  0.913240
max    1.502114  1.174630  0.542316  1.857938

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.620992    0.108518    0.146063    1.502114   -0.401894    0.871891
B   -1.255061    1.174630    0.669834   -0.481438   -1.838668    1.022357
C    0.542316   -0.730138   -0.258898   -0.445906   -1.112530   -0.184152
D    1.050026    0.259597    0.502883    1.857938    0.156224   -0.197625

In [18]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01  1.050026  0.542316 -1.255061 -1.620992
2013-01-02  0.259597 -0.730138  1.174630  0.108518
2013-01-03  0.502883 -0.258898  0.669834  0.146063
2013-01-04  1.857938 -0.445906 -0.481438  1.502114
2013-01-05  0.156224 -1.112530 -1.838668 -0.401894
2013-01-06 -0.197625 -0.184152  1.022357  0.871891

In [20]:
df.sort_values(by=['B'])

                   A         B         C         D
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224
2013-01-01 -1.620992 -1.255061  0.542316  1.050026
2013-01-04  1.502114 -0.481438 -0.445906  1.857938
2013-01-03  0.146063  0.669834 -0.258898  0.502883
2013-01-06  0.871891  1.022357 -0.184152 -0.197625
2013-01-02  0.108518  1.174630 -0.730138  0.259597

In [22]:
df['A']

2013-01-01   -1.620992
2013-01-02    0.108518
2013-01-03    0.146063
2013-01-04    1.502114
2013-01-05   -0.401894
2013-01-06    0.871891
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.620992 -1.255061  0.542316  1.050026
2013-01-02  0.108518  1.174630 -0.730138  0.259597
2013-01-03  0.146063  0.669834 -0.258898  0.502883

In [24]:
df['20130101':'20130102']

                   A         B         C         D
2013-01-01 -1.620992 -1.255061  0.542316  1.050026
2013-01-02  0.108518  1.174630 -0.730138  0.259597

In [26]:
a = dates[0]
df.loc[dates[0]]

A   -1.620992
B   -1.255061
C    0.542316
D    1.050026
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.620992 -1.255061
2013-01-02  0.108518  1.174630
2013-01-03  0.146063  0.669834
2013-01-04  1.502114 -0.481438
2013-01-05 -0.401894 -1.838668
2013-01-06  0.871891  1.022357

In [28]:
df.loc['20130101':'20130102',['A','B']]

                   A         B
2013-01-01 -1.620992 -1.255061
2013-01-02  0.108518  1.174630

In [29]:
df.loc['20130101',['A','B']]

A   -1.620992
B   -1.255061
Name: 2013-01-01 00:00:00, dtype: float64

In [30]:
df.loc[dates[0],'A']

-1.6209916987607436

In [31]:
df.at[dates[0],'A']

-1.6209916987607436

In [32]:
df.iloc[3]

A    1.502114
B   -0.481438
C   -0.445906
D    1.857938
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.502114 -0.481438
2013-01-05 -0.401894 -1.838668

In [34]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.108518 -0.730138
2013-01-03  0.146063 -0.258898
2013-01-05 -0.401894 -1.112530

In [35]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.108518  1.174630 -0.730138  0.259597
2013-01-03  0.146063  0.669834 -0.258898  0.502883

In [36]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.255061  0.542316
2013-01-02  1.174630 -0.730138
2013-01-03  0.669834 -0.258898
2013-01-04 -0.481438 -0.445906
2013-01-05 -1.838668 -1.112530
2013-01-06  1.022357 -0.184152

In [37]:
df.iloc[1,1]

1.1746295164248428

In [39]:
df.iat[1,1]

1.1746295164248428

In [40]:
df[df.A>0]

                   A         B         C         D
2013-01-02  0.108518  1.174630 -0.730138  0.259597
2013-01-03  0.146063  0.669834 -0.258898  0.502883
2013-01-04  1.502114 -0.481438 -0.445906  1.857938
2013-01-06  0.871891  1.022357 -0.184152 -0.197625

In [41]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.542316  1.050026
2013-01-02  0.108518  1.174630       NaN  0.259597
2013-01-03  0.146063  0.669834       NaN  0.502883
2013-01-04  1.502114       NaN       NaN  1.857938
2013-01-05       NaN       NaN       NaN  0.156224
2013-01-06  0.871891  1.022357       NaN       NaN

In [43]:
df3 = df.copy()
df3['E'] = ['one','one','two','three','four','five']
df3

                   A         B         C         D      E
2013-01-01 -1.620992 -1.255061  0.542316  1.050026    one
2013-01-02  0.108518  1.174630 -0.730138  0.259597    one
2013-01-03  0.146063  0.669834 -0.258898  0.502883    two
2013-01-04  1.502114 -0.481438 -0.445906  1.857938  three
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224   four
2013-01-06  0.871891  1.022357 -0.184152 -0.197625   five

In [44]:
df3[df3['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.146063  0.669834 -0.258898  0.502883   two
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224  four

In [45]:
s1 = pd.Series([1,2,3,4,5,6],index = pd.date_range('20130102',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [47]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01 -1.620992 -1.255061  0.542316  1.050026  NaN
2013-01-02  0.108518  1.174630 -0.730138  0.259597  1.0
2013-01-03  0.146063  0.669834 -0.258898  0.502883  2.0
2013-01-04  1.502114 -0.481438 -0.445906  1.857938  3.0
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224  4.0
2013-01-06  0.871891  1.022357 -0.184152 -0.197625  5.0

In [48]:
df.at[dates[0],'A'] = 0
df.iat[0,1]=0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.542316  1.050026  NaN
2013-01-02  0.108518  1.174630 -0.730138  0.259597  1.0
2013-01-03  0.146063  0.669834 -0.258898  0.502883  2.0
2013-01-04  1.502114 -0.481438 -0.445906  1.857938  3.0
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224  4.0
2013-01-06  0.871891  1.022357 -0.184152 -0.197625  5.0

In [49]:
df.loc[:,'D'] = np.array([5]*len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.542316  5  NaN
2013-01-02  0.108518  1.174630 -0.730138  5  1.0
2013-01-03  0.146063  0.669834 -0.258898  5  2.0
2013-01-04  1.502114 -0.481438 -0.445906  5  3.0
2013-01-05 -0.401894 -1.838668 -1.112530  5  4.0
2013-01-06  0.871891  1.022357 -0.184152  5  5.0

In [50]:
df2 = df.copy()
df2[df2>0]=-df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.542316 -5  NaN
2013-01-02 -0.108518 -1.174630 -0.730138 -5 -1.0
2013-01-03 -0.146063 -0.669834 -0.258898 -5 -2.0
2013-01-04 -1.502114 -0.481438 -0.445906 -5 -3.0
2013-01-05 -0.401894 -1.838668 -1.112530 -5 -4.0
2013-01-06 -0.871891 -1.022357 -0.184152 -5 -5.0